Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/B16B.tmx
Source language: en_us
Languages: zh_cn

source: The Origin of Darwin
zh_cn: 达尔文的起源

source: MY fellow primates, 200 years ago today, Charles Darwin was born.
zh_cn: 灵长类同胞们，200年前的今天（1809年2月12日――译者注），查尔斯达尔文诞生。

source: Please join me in wishing him happy birthday!
zh_cn: 让我们一起祝他生日快乐吧！

source: Unlike many members of the human species, Darwin makes an easy hero.
zh_cn: 相比人类中大多数成员，达尔文轻松地成了英雄。

source: His achievements were prodigious; his science, meticulous.
zh_cn: 他的成就巨大，他的学说缜密。

source: His work transformed our understanding of the planet and of ourselves.
zh_cn: 他的工作改变了我们对地球和人类自身的认识。

source: At the same time, he was a humane, gentle, decent man, a loving husband and father, and a loyal friend.
zh_cn: 同时，他是一个仁慈、温和、体面的人，一个充满爱的丈夫和父亲，一个忠实的朋友。

source: Judging by his letters, he was also sometimes quite funny.
zh_cn: 在他的书信中，也不时发现他的俏皮。

source: He was, in other words, one of those rare beings, as likeable as he was impressive.
zh_cn: 换句话说，他是个稀罕的生物，令人印象深刻，又这般惹人喜爱。

source: For example, after his marriage, Darwin worked at home, and his children (of the 10 he fathered, seven survived to adulthood) remembered playing in his study.
zh_cn: 比如，结婚之后，达尔文在家里工作，他的孩子仍记得在他的书房中打闹的情景。

source: Later, one of his sons recounted how, after an argument, his father came up to his room, sat on his bed, and apologized for losing his temper.
zh_cn: （ 十个孩子中的七个活到了成年）后来，达尔文的一个儿子提到，在一次争执后，他的爸爸走进他的房间坐到床边，为自己发脾气而道歉。

source: And although often painted as a recluse, Darwin served as a local magistrate, meting out justice in his dining room.
zh_cn: 达尔文担任过当地的行政长官（尽管常被描述为一名隐士），在自己的餐厅里申张正义。

source: Moreover, while many of his contemporaries approved of slavery, Darwin did not.
zh_cn: 此外，他那个时代很多同僚赞成奴隶制，而达尔文却没有。

source: He came from a family of ardent abolitionists, and he was revolted by what he saw in slave countries: "Near Rio de Janeiro I lived opposite to an old lady, who kept screws to crush the fingers of her female slaves.
zh_cn: 他来自于一个强烈的废奴主义家庭。在蓄奴国家中的所见所闻使他厌恶，“在里约热内卢我住所对面的一位老太太，把螺丝钉拧进她的女奴隶的手指里。

source: I have stayed in a house where a young household mulatto, daily and hourly, was reviled, beaten and persecuted enough to break the spirit of the lowest animal ....
zh_cn: 和我同住在一座房屋的年轻白黑混血人，每天甚至每小时都被辱骂，殴打和迫害，即便是最低等的动物也难以忍受....

source: It makes one's blood boil, yet heart tremble, to think that we Englishmen and our American descendants, with their boastful cry of liberty, have been and are so guilty."
zh_cn: 我们英国人和我们的美国后裔们炫耀着对自由的呐喊，一想到这我们虽热血沸腾，内心却在颤抖，已经并将永远充满负罪感。”

source: He practiced a kind of ideal, dream-like science.
zh_cn: 他做了一种理想的， 梦幻般的科学实践。

source: He examined the minutiae of nature --- shells of barnacles, pistils of flowers --- but worked on grand themes.
zh_cn: 他研究自然的细节――海洋吸附甲壳动物的外壳、花朵的雌蕊――但都服务于宏观的主题。

source: He corresponded with lofty men of learning, but also with farmers and pigeon breeders.
zh_cn: 他既和高贵的人通信，也向农民和养鸽人学习。

source: He observed, questioned, experimented, constantly testing his ideas.
zh_cn: 他观察，质疑，试验，不断地测试他的想法。

source: Could plants from the mainland colonize a newly formed island?
zh_cn: 植物可以从大陆移植到新出现的岛上吗？

source: If so, they would need a way to get there.
zh_cn: 如果是这样，它们将需要一种方式来抵达。

source: Could they survive in the ocean?
zh_cn: 他们能在海洋中生存吗？

source: To find out, he immersed seeds in salt water for weeks, then planted them to see how many could sprout.
zh_cn: 为了找到答案，他把种子浸泡在海水中数周，然后再种植，看有多少能够发芽。

source: He reported, for example, that "an asparagus plant with ripe berries floated for 23 days, when dried it floated for 85 days, and the seeds afterwards germinated."
zh_cn: 例如他说，“一个芦笋与熟浆果在海水中漂浮了23天，在空气中干燥了85天，这样的种子还能够发芽。”

source: The Atlantic current moved at 33 nautical miles a day; he figured that would take a seed more than 1,300 miles in 42 days.
zh_cn: 大西洋洋流日行33海里；他计算出一粒种子42天中能够漂过1300英里。

source: Yes, seeds could travel by sea.
zh_cn: 是的，种子能够在海上旅行。

source: He published important work on subjects as diverse as the biology of carnivorous plants, barnacles, earthworms and the formation of coral reefs.
zh_cn: 他出版的重要著作课题广泛，有肉食植物，有海洋吸附甲壳动物，和珊瑚礁形成生物学。

source: He wrote a travelogue, "The Voyage of the Beagle," that was an immediate best seller and remains a classic of its kind.
zh_cn: 他做了旅游记录，《猎兔犬号航海记》，立刻成为畅销书，直到现在仍然是同类书中的经典。

source: And as if that was not enough, he discovered two major forces in evolution --- natural selection and sexual selection --- and wrote three radical scientific masterpieces, "On the Origin of Species" (1859), "The Descent of Man and Selection in Relation to Sex" (1871) and "The Expression of the Emotions in Man and Animals" (1872).
zh_cn: 但这好像还不够，他发现了进化中的两股主要力量――自然选择和性选择――并写了三本激进的科学著作：《物种起源》（1859年），《人类由来与性择》（ 1871年）和《人类与动物的情感表达》（1872年）。

source: The "Origin," of course, is what he is best known for.
zh_cn: 当然，《物种起源》是他最有名的作品。

source: This volume, colossal in scope yet minutely detailed, laid the foundations of modern biology.
zh_cn: 这部书研究视野宏大而详尽，成为现代生物学的奠基之作。

source: Here, Darwin presented extensive and compelling evidence that all living beings --- including humans --- have evolved from a common ancestor, and that natural selection is the chief force driving evolutionary change.
zh_cn: 达尔文在书中列举了广泛且和令人信服的证据表明，包括人类在内的一切生物是从共同的祖先进化而来，而自然选择是进化的推动性力量。

source: Sexual selection, he argued, was an additional force, responsible for spectacular features like the tail feathers of peacocks that are useless for (or even detrimental to) survival but essential for seduction.
zh_cn: 他认为性选择是一种额外的力量，负责具有吸引力的外貌，比如孔雀的尾羽对其生存无用乃至有害，却是诱惑力必不可少的来源。

source: Before the "Origin," similarities and differences between species were mere curiosities; questions as to why a certain plant is succulent like a cactus or deciduous like a maple could be answered only, "Because." Biology itself was nothing more than a vast exercise in catalog and description.
zh_cn: 在《物种起源》之前，很少有人对物种间的差异提出疑问；能被回答的仅是某些植物如仙人掌为何茎叶肥厚含水分多，或是枫树的叶子每年都会掉落？“因为”，生物学本身只是一个庞大的使用目录和说明。

source: After the "Origin," all organisms became connected, part of the same, profoundly ancient, family tree.
zh_cn: 在《物种起源》之前，所有有机物都或多或少与树的族谱有古老的联系。

source: Similarities and differences became comprehensible and explicable.
zh_cn: 相似点和不同点变得可以解释和易于了解。

source: In short, Darwin gave us a framework for asking questions about the natural world, and about ourselves.
zh_cn: 简而言之，达尔文为我们构建了一个框架，来询问有关自然界和人类自身的问题。

source: He was not right about everything.
zh_cn: 他的学说并非完全正确。

source: How could he have been?
zh_cn: 他怎么可能做到呢？

source: Famously, he didn't know how genetics works; as for DNA --- well, the structure of the molecule wasn't discovered until 1953.
zh_cn: 显而易见，他不知道遗传学怎样起作用；至于DNA――呵呵，直到1953年分子结构才被发现。

source: So today's view of evolution is much more nuanced than his.
zh_cn: 因此，今天再来看进化的问题已与他的看法有所不同。

source: We have incorporated genetics, and expanded and refined our understanding of natural selection, and of the other forces in evolution.
zh_cn: 我们已经吸纳了遗传学，扩大和完善我们对于自然选择及其它进化力量的理解。

source: But what is astonishing is how much Darwin did know, and how far he saw.
zh_cn: 但令人惊奇的是，达尔文怎么能知道那么多，还有他的高瞻远瞩。
